IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_usb_regs.xml
	<register id="USBDEVCTL" width="16" page="1" offset="0x30" internal="0" description="USB Device Control">
		<bitfield id="SESSION" description="Session Start/End" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="HOSTREQ" description="Host Request" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="HOST" description="Host Mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="VBUS" description="Vbus Level" begin="4" end="3" width="2" rwaccess="RW"/>
		<bitfield id="LSDEV" description="Low Speed Device Detected" begin="5" end="5" width="1" rwaccess="R"/>
		<bitfield id="FSDEV" description="Full Speed Device Detected" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="DEV" description="Device Mode" begin="7" end="7" width="1" rwaccess="R"/>
	</register>
	<register id="USBTXFIFOSZ" width="8" page="1" offset="0x31" internal="0" description="USB Transmit Dynamic FIFO Sizing">
		<bitfield id="SIZE" description="Max Packet Size" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="DPB" description="Double Packet Buffer Support" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXFIFOSZ" width="8" page="1" offset="0x31" internal="0" description="USB Receive Dynamic FIFO Sizing">
		<bitfield id="SIZE" description="Max Packet Size" begin="3" end="0" width="4" rwaccess="R"/>
		<bitfield id="DPB" description="Double Packet Buffer Support" begin="4" end="4" width="1" rwaccess="RW"/>
	</register>
	<register id="USBTXFIFOADD" width="16" page="1" offset="0x32" internal="0" description="USB Transmit FIFO Start Address">
		<bitfield id="ADDR" description="Endpoint Data" begin="8" end="0" width="9" rwaccess="RW"/>
	</register>
	<register id="USBRXFIFOADD" width="16" page="1" offset="0x33" internal="0" description="USB Receive FIFO Start Address">
		<bitfield id="ADDR" description="Endpoint Data" begin="8" end="0" width="9" rwaccess="RW"/>
	</register>
	<register id="USBCONTIM" width="8" page="1" offset="0x3d" internal="0" description="USB Connect Timing">
		<bitfield id="WTID" description="Wait ID" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="WTCON" description="Connect Wait" begin="7" end="4" width="4" rwaccess="RW"/>
	</register>
	<register id="USBFSEOF" width="8" page="1" offset="0x3e" internal="0" description="USB Full-Speed Last Transaction to End of Frame Timing">
		<bitfield id="FSEOFG" description="The full-speed end-of-frame gap field" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="USBLSEOF" width="8" page="1" offset="0x3f" internal="0" description="USB Low-Speed Last Transaction to End of Frame Timing">
		<bitfield id="LSEOFG" description="The low-speed end-of-frame gap field" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="USBTXFUNCADDR0" width="8" page="1" offset="0x40" internal="0" description="USB Transmit Functional Address Endpoint 0">
		<bitfield id="ADDR" description="Device Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBADDR0" width="8" page="1" offset="0x41" internal="0" description="USB Transmit Hub Address Endpoint 0">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBPORT0" width="8" page="1" offset="0x41" internal="0" description="USB Transmit Hub Port Endpoint 0">
		<bitfield id="ADDR" description="Hub Port" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXFUNCADDR1" width="8" page="1" offset="0x44" internal="0" description="USB Transmit Functional Address Endpoint 1">
		<bitfield id="ADDR" description="Device Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBADDR1" width="8" page="1" offset="0x45" internal="0" description="USB Transmit Hub Address Endpoint 1">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBPORT1" width="8" page="1" offset="0x45" internal="0" description="USB Transmit Hub Port Endpoint 1">
		<bitfield id="ADDR" description="Hub Port" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBRXFUNCADDR1" width="8" page="1" offset="0x46" internal="0" description="USB Receive Functional Address Endpoint 1">
		<bitfield id="ADDR" description="Device Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBRXHUBADDR1" width="8" page="1" offset="0x47" internal="0" description="USB Receive Hub Address Endpoint 1">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="MULTTRAN" description="Hub has Multiple Translators" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXHUBPORT1" width="8" page="1" offset="0x47" internal="0" description="USB Receive Hub Port Endpoint 1">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXFUNCADDR2" width="8" page="1" offset="0x48" internal="0" description="USB Transmit Functional Address Endpoint 2">
		<bitfield id="ADDR" description="Device Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBADDR2" width="8" page="1" offset="0x49" internal="0" description="USB Transmit Hub Address Endpoint 2">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBPORT2" width="8" page="1" offset="0x49" internal="0" description="USB Transmit Hub Port Endpoint 2">
		<bitfield id="ADDR" description="Hub Port" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBRXFUNCADDR2" width="8" page="1" offset="0x4a" internal="0" description="USB Receive Functional Address Endpoint 2">
		<bitfield id="ADDR" description="Device Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
