IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_usb_regs.xml
	<register id="USBRXHUBADDR2" width="8" page="1" offset="0x4b" internal="0" description="USB Receive Hub Address Endpoint 2">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="MULTTRAN" description="Hub has Multiple Translators" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXHUBPORT2" width="8" page="1" offset="0x4b" internal="0" description="USB Receive Hub Port Endpoint 2">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXFUNCADDR3" width="8" page="1" offset="0x4c" internal="0" description="USB Transmit Functional Address Endpoint 3">
		<bitfield id="ADDR" description="Device Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBADDR3" width="8" page="1" offset="0x4d" internal="0" description="USB Transmit Hub Address Endpoint 3">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTXHUBPORT3" width="8" page="1" offset="0x4d" internal="0" description="USB Transmit Hub Port Endpoint 3">
		<bitfield id="ADDR" description="Hub Port" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBRXFUNCADDR3" width="8" page="1" offset="0x4e" internal="0" description="USB Receive Functional Address Endpoint 3">
		<bitfield id="ADDR" description="Device Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBRXHUBADDR3" width="8" page="1" offset="0x4f" internal="0" description="USB Receive Hub Address Endpoint 3">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
		<bitfield id="MULTTRAN" description="Hub has Multiple Translators" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXHUBPORT3" width="8" page="1" offset="0x4f" internal="0" description="USB Receive Hub Port Endpoint 3">
		<bitfield id="ADDR" description="Hub Address" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBCSRL0" width="8" page="1" offset="0x81" internal="0" description="USB Control and Status Endpoint 0 Low">
		<bitfield id="RXRDY" description="Receive Packet Ready" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TXRDY" description="Transmit Packet Ready" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="STALLED" description="Endpoint Stalled" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DATAEND_SETUP" description="Data End/Setup Packet" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SETEND_ERROR" description="Setup End/Error" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="STALL_RQPKT" description="Send Stall /Request Packet" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="RXRDYC_STATUS" description="RXRDY Clear/STATUS Packet" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SETENDC_NAKTO" description="Setup End Clear/NAK Timeout" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBCSRH0" width="8" page="1" offset="0x81" internal="0" description="USB Control and Status Endpoint 0 High">
		<bitfield id="FLUSH" description="Flush FIFO" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DT" description="Data Toggle" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DTWE" description="Data Toggle Write Enable" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="USBCOUNT0" width="8" page="1" offset="0x84" internal="0" description="USB Receive Byte Count Endpoint 0">
		<bitfield id="COUNT" description="FIFO Count" begin="6" end="0" width="7" rwaccess="RW"/>
	</register>
	<register id="USBTYPE0" width="8" page="1" offset="0x85" internal="0" description="USB Type Endpoint 0">
		<bitfield id="SPEED" description="Operating Speed" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="USBNAKLMT" width="8" page="1" offset="0x85" internal="0" description="USB NAK Limit">
		<bitfield id="NAKLMT" description="EP0 NAK Limit" begin="4" end="0" width="5" rwaccess="RW"/>
	</register>
	<register id="USBTXMAXP1" width="16" page="1" offset="0x88" internal="0" description="USB Maximum Transmit Data Endpoint 1">
		<bitfield id="MAXLOAD" description="Maximum Payload" begin="10" end="0" width="11" rwaccess="RW"/>
	</register>
	<register id="USBTXCSRL1" width="8" page="1" offset="0x89" internal="0" description="USB Transmit Control and Status Endpoint 1 Low">
		<bitfield id="TXRDY" description="Transmit Packet Ready" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FIFONE" description="FIFO Not Empty" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="UNDRN_ERROR1" description="Underun/Error" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FLUSH" description="Flush FIFO" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="STALL_SETUP" description="Send Stall/Setup Packet" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="STALLED" description="Endpoint Stalled" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CLRDT" description="Clear Data Toggle" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="NAKTO" description="NAK Timeout" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBTXCSRH1" width="8" page="1" offset="0x89" internal="0" description="USB Transmit Control and Status Endpoint 1 High">
		<bitfield id="DT" description="Data Toggle" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DTWE" description="Data Toggle Write Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMAMOD" description="DMA Request Mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FDT" description="Force Data Toggle" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DMAEN" description="DMA Request Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MODE" description="Mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ISO" description="Isochronous Transfers" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="AUTOSET" description="Auto Set" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXMAXP1" width="16" page="1" offset="0x8a" internal="0" description="USB Maximum Receive Data Endpoint 1">
		<bitfield id="MAXLOAD" description="Maximum Payload" begin="10" end="0" width="11" rwaccess="RW"/>
	</register>
	<register id="USBRXCSRL1" width="8" page="1" offset="0x8b" internal="0" description="USB Receive Control and Status Endpoint 1 Low">
		<bitfield id="RXRDY" description="Recieve Packet Ready" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FULL" description="FIFO Full" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OVERERROR1" description="Overrun/Error" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DATAERRNAKTO" description="Data Error/NAK Timeout" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FLUSH" description="Flush FIFO" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="STALLREQPKT" description="Send Stall/Request Packet" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="STALLED" description="Endpoint Stalled" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLRDT" description="Clear Data Toggle" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXCSRH1" width="8" page="1" offset="0x8b" internal="0" description="USB Receive Control and Status Endpoint 1 High">
		<bitfield id="DT" description="Data Toggle" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DTWE" description="Data Toggle Write Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DMAMOD" description="DMA Request Mode" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DISNYETPIDERR" description="Disable NYET / PID Error" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DMAEN" description="DMA Request Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ISOAUTORQ" description="Isochronous Transfers/Auto Request" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="AUTOCL" description="Auto Clear" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXCOUNT1" width="16" page="1" offset="0x8c" internal="0" description="USB Receive Byte Count Endpoint 1">
		<bitfield id="COUNT" description="Receive Packet Count" begin="12" end="0" width="13" rwaccess="R"/>
	</register>
	<register id="USBTXTYPE1" width="8" page="1" offset="0x8d" internal="0" description="USB Host Transmit Configure Type Endpoint 1">
		<bitfield id="TEP" description="Target Endpoint Number" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="PROTO" description="Protocol" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SPEED" description="Operating Speed" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
