IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_usb_regs.xml
	<register id="USBTXINTERVAL1" width="8" page="1" offset="0x8d" internal="0" description="USB Host Transmit Interval Endpoint 1">
		<bitfield id="TXPOLLNAKLMT" description="TX Polling / NAK Limit" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="USBRXTYPE1" width="8" page="1" offset="0x8e" internal="0" description="USB Host Configure Receive Type Endpoint 1">
		<bitfield id="TEP" description="Target Endpoint Number" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="PROTO" description="Protocol" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SPEED" description="Operating Speed" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="USBRXINTERVAL1" width="8" page="1" offset="0x8e" internal="0" description="USB Host Receive Polling Interval Endpoint 1">
		<bitfield id="RXPOLLNAKLMT" description="RX Polling / NAK Limit" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="USBTXMAXP2" width="16" page="1" offset="0x90" internal="0" description="USB Maximum Transmit Data Endpoint 2">
		<bitfield id="MAXLOAD" description="Maximum Payload" begin="10" end="0" width="11" rwaccess="RW"/>
	</register>
	<register id="USBTXCSRL2" width="8" page="1" offset="0x91" internal="0" description="USB Transmit Control and Status Endpoint 2 Low">
		<bitfield id="TXRDY" description="Transmit Packet Ready" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FIFONE" description="FIFO Not Empty" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="UNDRNERROR2" description="Underun/Error" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FLUSH" description="Flush FIFO" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="STALL_SETUP" description="Send Stall/Setup Packet" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="STALLED" description="Endpoint Stalled" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CLRDT" description="Clear Data Toggle" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="NAKTO" description="NAK Timeout" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBTXCSRH2" width="8" page="1" offset="0x91" internal="0" description="USB Transmit Control and Status Endpoint 2 High">
		<bitfield id="DT" description="Data Toggle" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DTWE" description="Data Toggle Write Enable" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DMAMOD" description="DMA Request Mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="FDT" description="Force Data Toggle" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DMAEN" description="DMA Request Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="MODE" description="Mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ISO" description="Isochronous Transfers" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="AUTOSET" description="Auto Set" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXMAXP2" width="16" page="1" offset="0x92" internal="0" description="USB Maximum Receive Data Endpoint 2">
		<bitfield id="MAXLOAD" description="Maximum Payload" begin="10" end="0" width="11" rwaccess="RW"/>
	</register>
	<register id="USBRXCSRL2" width="8" page="1" offset="0x93" internal="0" description="USB Receive Control and Status Endpoint 2 Low">
		<bitfield id="RXRDY" description="Recieve Packet Ready" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="FULL" description="FIFO Full" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="OVERERROR2" description="Overrun/Error" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DATAERRNAKTO" description="Data Error/NAK Timeout" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="FLUSH" description="Flush FIFO" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="STALLREQPKT" description="Send Stall/Request Packet" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="STALLED" description="Endpoint Stalled" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CLRDT" description="Clear Data Toggle" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXCSRH2" width="8" page="1" offset="0x93" internal="0" description="USB Receive Control and Status Endpoint 2 High">
		<bitfield id="DT" description="Data Toggle" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="DTWE" description="Data Toggle Write Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="DMAMOD" description="DMA Request Mode" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="DISNYETPIDERR" description="Disable NYET / PID Error" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="DMAEN" description="DMA Request Enable" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="ISOAUTORQ" description="Isochronous Transfers/Auto Request" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="AUTOCL" description="Auto Clear" begin="7" end="7" width="1" rwaccess="RW"/>
	</register>
	<register id="USBRXCOUNT2" width="16" page="1" offset="0x94" internal="0" description="USB Receive Byte Count Endpoint 2">
		<bitfield id="COUNT" description="Receive Packet Count" begin="12" end="0" width="13" rwaccess="R"/>
	</register>
	<register id="USBTXTYPE2" width="8" page="1" offset="0x95" internal="0" description="USB Host Transmit Configure Type Endpoint 2">
		<bitfield id="TEP" description="Target Endpoint Number" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="PROTO" description="Protocol" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="SPEED" description="Operating Speed" begin="7" end="6" width="2" rwaccess="RW"/>
	</register>
	<register id="USBTXINTERVAL2" width="8" page="1" offset="0x95" internal="0" description="USB Host Transmit Interval Endpoint 2">
		<bitfield id="TXPOLLNAKLMT" description="TX Polling / NAK Limit" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
