IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_usb_regs.xml
	<register id="USBRXINTERVAL3" width="8" page="1" offset="0x9e" internal="0" description="USB Host Receive Polling Interval Endpoint 3">
		<bitfield id="RXPOLLNAKLMT" description="RX Polling / NAK Limit" begin="7" end="0" width="8" rwaccess="RW"/>
	</register>
	<register id="USBRQPKTCOUNT1" width="16" page="1" offset="0x182" internal="0" description="USB Request Packet Count in Block Transfer Endpoint 1">
		<bitfield id="COUNT" description="FIFO Count" begin="12" end="0" width="13" rwaccess="RW"/>
	</register>
	<register id="USBRQPKTCOUNT2" width="16" page="1" offset="0x184" internal="0" description="USB Request Packet Count in Block Transfer Endpoint 2">
		<bitfield id="COUNT" description="FIFO Count" begin="12" end="0" width="13" rwaccess="RW"/>
	</register>
	<register id="USBRQPKTCOUNT3" width="16" page="1" offset="0x186" internal="0" description="USB Request Packet Count in Block Transfer Endpoint 3">
		<bitfield id="COUNT" description="FIFO Count" begin="12" end="0" width="13" rwaccess="RW"/>
	</register>
	<register id="USBRXDPKTBUFDIS" width="16" page="1" offset="0x1a0" internal="0" description="USB Receive Double Packet Buffer Disable">
		<bitfield id="EP1" description="EP1 RX Double Packet Buffer Disable" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EP2" description="EP2 RX Double Packet Buffer Disable" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EP3" description="EP3 RX Double Packet Buffer Disable" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="USBTXDPKTBUFDIS" width="16" page="1" offset="0x1a1" internal="0" description="USB Transmit Double Packet Buffer Disable">
		<bitfield id="EP1" description="EP1 TX Double Packet Buffer Disable" begin="1" end="1" width="1" rwaccess="R"/>
		<bitfield id="EP2" description="EP2 TX Double Packet Buffer Disable" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="EP3" description="EP3 TX Double Packet Buffer Disable" begin="3" end="3" width="1" rwaccess="R"/>
	</register>
	<register id="USBEPC" width="32" page="1" offset="0x200" internal="0" description="USB External Power Control">
		<bitfield id="EPEN" description="External Power Supply Enable Configuration" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="EPENDE" description="EPEN Drive Enable" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PFLTEN" description="Power Fault Input Enable" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PFLTSEN" description="Power Fault Sense" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PFLTAEN" description="Power Fault Action Enable" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PFLTACT" description="Power Fault Action" begin="9" end="8" width="2" rwaccess="RW"/>
	</register>
	<register id="USBEPCRIS" width="32" page="1" offset="0x202" internal="0" description="USB External Power Control Raw Interrupt Status">
		<bitfield id="PF" description="Power Fault Interrupt Status" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="USBEPCIM" width="32" page="1" offset="0x204" internal="0" description="USB External Power Control Interrupt Mask">
		<bitfield id="PF" description="Power Fault Interrupt Mask" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="USBEPCISC" width="32" page="1" offset="0x206" internal="0" description="USB External Power Control Interrupt Status and Clear">
		<bitfield id="PF" description="Power Fault Interrupt Status and Clear" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="USBDRRIS" width="32" page="1" offset="0x208" internal="0" description="USB Device RESUME Raw Interrupt Status">
		<bitfield id="RESUME" description="Resume Interrupt Status" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="USBDRIM" width="32" page="1" offset="0x20a" internal="0" description="USB Device RESUME Interrupt Mask">
		<bitfield id="RESUME" description="Resume Interrupt Mask" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="USBDRISC" width="32" page="1" offset="0x20c" internal="0" description="USB Device RESUME Interrupt Status and Clear">
		<bitfield id="RESUME" description="Resume Interrupt Status and Clear" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USBGPCS" width="32" page="1" offset="0x20e" internal="0" description="USB General-Purpose Control and Status">
		<bitfield id="DEVMOD" description="Device Mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DEVMODOTG" description="Enable Device Mode" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="USBVDC" width="32" page="1" offset="0x218" internal="0" description="USB VBUS Droop Control">
		<bitfield id="VBDEN" description="Vbus Droop Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USBVDCRIS" width="32" page="1" offset="0x21a" internal="0" description="USB VBUS Droop Control Raw Interrupt Status">
		<bitfield id="VD" description="Vbus Droop Raw Interrupt Status" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="USBVDCIM" width="32" page="1" offset="0x21c" internal="0" description="USB VBUS Droop Control Interrupt Mask">
		<bitfield id="VD" description="Vbus Droop Interrupt Mask" begin="0" end="0" width="1" rwaccess="R"/>
	</register>
	<register id="USBVDCISC" width="32" page="1" offset="0x21e" internal="0" description="USB VBUS Droop Control Interrupt Status and Clear">
		<bitfield id="VD" description="Vbus Droop Interrupt Status and Clear" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USBIDVRIS" width="32" page="1" offset="0x222" internal="0" description="USB ID Valid Detect Raw Interrupt Status">
		<bitfield id="ID" description="ID Valid Detect Raw Interrupt Status" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USBIDVIM" width="32" page="1" offset="0x224" internal="0" description="USB ID Valid Detect Interrupt Mask">
		<bitfield id="ID" description="ID Valid Detect Interrupt mask" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="USBIDVISC" width="32" page="1" offset="0x226" internal="0" description="USB ID Valid Detect Interrupt Status and Clear">
		<bitfield id="ID" description="ID Valid Detect Interrupt Status and Clear" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
